<a href="https://colab.research.google.com/github/stella-depuydt/CS-167/blob/main/titanic_exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd

In [5]:
from google.colab import drive
drive.mount('/content/drive')

titanic = pd.read_csv('/content/drive/MyDrive/Datasets/titanic.csv')
titanic.head()

Mounted at /content/drive

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
ages = titanic['age']
ages.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [7]:
titanic_subset = titanic[['survived', 'deck', 'sex', 'age']]
titanic_subset.head()

   survived deck     sex   age
0         0  NaN    male  22.0
1         1    C  female  38.0
2         1  NaN  female  26.0
3         1    C  female  35.0
4         0  NaN    male  35.0

Multiple conditions:

In [8]:
women_and_children = titanic[(titanic.age <18) | (titanic.sex == 'female')]
women_and_children.shape [0]
women_and_children.survived.sum()

256

In [18]:
titanic_subset = titanic['age']
titanic.old = titanic_subset.idxmax()
titanic.old

titanic.loc[630]

survived                 1
pclass                   1
sex                   male
age                   80.0
sibsp                    0
parch                    0
fare                  30.0
embarked                 S
class                First
who                    man
adult_male            True
deck                     A
embark_town    Southampton
alive                  yes
alone                 True
Name: 630, dtype: object

In [19]:
#how prof did it
ndx = titanic.age.idxmax()
print(ndx)
fare = titanic.loc[ndx].fare
fare

630

30.0